export const WEPAY_ERRORS: Record<string, string> = {
    '00000': 'รายการสำเร็จ',
    '10001': 'Internal Error (ไม่สามารถเชื่อมต่อระบบฐานข้อมูลได้)',
    '10002': 'Internal Error (รายการไม่สมบูรณ์)',
    '10003': 'Internal Error (Too Many Requests)',
    '10004': 'Internal Error (เกิดข้อผิดพลาดในการสร้างรายการใหม่)',
    '20001': 'Username หรือ Password มีรูปแบบไม่ถูกต้อง',
    '20003': 'Username หรือ Password มีรูปแบบไม่ถูกต้อง',
    '20004': 'Username นี้ไม่สามารถเรียกใช้ API ได้',
    '20005': 'ไม่อนุญาตให้เข้าถึงระบบ (IP address นี้ไม่ได้รับอนุญาต)',
    '30001': 'ไม่พบ Company ที่ระบุ',
    '30002': 'Transaction ID ไม่ถูกต้อง',
    '30003': 'ไม่พบ Transaction ID ที่ระบุ',
    '30004': 'Tranasction ID ที่ระบุอยู่ในระหว่างการทำรายการ',
    '30005': 'Callback URL ไม่ถูกต้อง',
    '30006': 'Callback Reference ID ไม่ถูกต้อง',
    '30007': 'ระบุจำนวนเงินที่ชำระไม่ถูกต้อง',
    '30008': 'ระบุบริษัทไม่ถูกต้อง',
    '30009': 'ระบุ Ref.1 ไม่ถูกต้อง',
    '30010': 'ระบุ Ref.2 ไม่ถูกต้อง',
    '30011': 'ระบุ Ref.3 ไม่ถูกต้อง',
    '30012': 'ระบุ Ref.4 ไม่ถูกต้อง',
    '30013': 'บาร์โค้ดไม่ถูกต้อง',
    '30016': 'มีการทำรายการซ้ำ (พบ Callback Reference ID ซ้ำกัน)',
    '30017': 'ตรวจพบการเลือกบริษัทผิดพลาด (เช่น กรณีที่พบว่าหมายเลขบัตรเครดิตเป็นของธนาคารอื่น)',
    '30018': 'ตรวจพบความไม่ถูกต้องของยอดหนี้ (เช่น กรณีที่เกินกำหนดชำระเงิน หรือ ระบุยอดหนี้ไม่ถูกต้อง)',
    '30019': 'ยอดเงินในระบบไม่เพียงพอ',
    '30020': 'ไม่อนุญาตให้ชำระเงินให้กับบริษัทที่ระบุ'
}

export function getWePayErrorMessage(code: string): string {
    return WEPAY_ERRORS[code] || `Unknown Error (${code})`
}
